{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": false, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 157967, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "spatial_dropout1d_1", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "bidirectional_5", "class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "layer": {"class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_5", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}}, "merge_mode": "concat"}, "inbound_nodes": [[["spatial_dropout1d_1", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["bidirectional_5", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"clipnorm": 0.25, "lr": 9.999999747378752e-05, "beta_1": 0.699999988079071, "beta_2": 0.9900000095367432, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of46", "group1-shard2of46", "group1-shard3of46", "group1-shard4of46", "group1-shard5of46", "group1-shard6of46", "group1-shard7of46", "group1-shard8of46", "group1-shard9of46", "group1-shard10of46", "group1-shard11of46", "group1-shard12of46", "group1-shard13of46", "group1-shard14of46", "group1-shard15of46", "group1-shard16of46", "group1-shard17of46", "group1-shard18of46", "group1-shard19of46", "group1-shard20of46", "group1-shard21of46", "group1-shard22of46", "group1-shard23of46", "group1-shard24of46", "group1-shard25of46", "group1-shard26of46", "group1-shard27of46", "group1-shard28of46", "group1-shard29of46", "group1-shard30of46", "group1-shard31of46", "group1-shard32of46", "group1-shard33of46", "group1-shard34of46", "group1-shard35of46", "group1-shard36of46", "group1-shard37of46", "group1-shard38of46", "group1-shard39of46", "group1-shard40of46", "group1-shard41of46", "group1-shard42of46", "group1-shard43of46", "group1-shard44of46", "group1-shard45of46", "group1-shard46of46"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "bidirectional_5/forward_cu_dnnlstm_5/kernel", "shape": [300, 256], "dtype": "float32"}, {"name": "bidirectional_5/forward_cu_dnnlstm_5/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_5/forward_cu_dnnlstm_5/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_5/backward_cu_dnnlstm_5/kernel", "shape": [300, 256], "dtype": "float32"}, {"name": "bidirectional_5/backward_cu_dnnlstm_5/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional_5/backward_cu_dnnlstm_5/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 2], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding_3/embeddings", "shape": [157967, 300], "dtype": "float32"}]}]}